# 'Hi' + 'world' = 'Hiworld' - конкатенация
# 'Hi' * 12 = 'HiHiHiHiHiHiHiHiHiHiHiHi'
# my_str = 'Python', my_str[0] --> 'P' - взятие по индексу
# my_str[start:stop:step] - срез. т.к. строка не изменяема срез это новый объект
# len(my_str) - длина строки
# my_str.split(" ") - разбиваем строку по пробелам
# " ".join(["Name", "Surname"]) - соединяем строки
# "myStr".title() - с заглавной
# .upper() - все заглавные
# .lower() - все маленькие
# .count() - подсчитывает сколько символов в строке
# .replace() - производит замену
# .index() - поиск
# .find() - поиск но не выдаст ошибку если нет искомого

